`timescale 1ns / 1ps

    module instr_memory(
        input  [31:0] instr_raddr,
        output [31:0] instr_code
    );
    
    logic [31:0] rom_file [0:15]; //폭 32bit(4byte)
                                  //명령어 10개를 처리할 것이기 때문에 대충 16개 정도 있으면 됨
    
    initial begin
        for (int i=0; i<16; i++) begin
            rom_file[i] = 32'd0;
        end
        //                funct7   rs2   rs1  f3   rd   opcode
        // rom_file[0] = 32'b0000000_00001_00000_000_00011_0110011; //ADD x3 x0 x1: x3에 0+1 = 1을 저장
        // rom_file[1] = 32'b0100000_00001_00000_000_00100_0110011; //SUB x4 x0 x1: x4에 0-1 = -1을 저장
        // rom_file[2] = 32'b0000000_00010_00100_001_00101_0110011; //SLL x5 x4 x2: x5에 x3 << x2 연산결과를 저장
        // rom_file[3] = 32'b0000000_00010_00100_010_00110_0110011; //SLT x6 x4 x2: x6에 x3, x2 대소관계 결과를 저장
        // rom_file[4] = 32'b0000000_00010_00100_011_00111_0110011; //SLTU x7 x3 x2: x7에 x3, x2 대소관계 결과를 저장(unsigned)
        // rom_file[5] = 32'b0000000_00001_00011_100_01000_0110011;//XOR x8 x3 x1: x8에 00010=2 저장
        // rom_file[6] = 32'b0000000_00010_00100_101_01001_0110011; //SRL x9에 저장
        // rom_file[7] = 32'b0100000_00010_00100_101_01010_0110011;//SRA x10에 저장
        // rom_file[8] = 32'b0000000_00010_00001_110_01011_0110011;//OR x11 x1 x2: x11에 3저장
        // rom_file[9] = 32'b0000000_00010_00001_111_01100_0110011; //AND x12 x1 x2: x12에 0저장

                            //imm[11:0]    rs1  f3   rd   opcode
        // // rom_file[0] = 32'b000000001010_00000_000_00001_0010011;
        // // rom_file[0] = 32'b0000_0000_1010_0000_0000_0000_1001_0011;
        // rom_file[0] = 32'hFFB00093;
        // //ADDI x1 x0 -5
        // //x0에 있는 데이터에 -5(imm)를 더해서 x1에 저장
        // //rd: x1
        // //rs1: x0
        // //imm: -5
        // //결과: x1에 -5 저장
        
        // //==================================================//
        // rom_file[1] = 32'h00A0A113;
        // //SLTI x2 x1 10
        // //-5와 10을 비교해서 -5가 더 작기 때문에 x2에 1 저장
        // //rd: x2
        // //rs1: x1(-5)
        // //imm: 10
        // //결과: x2에 1 저장
        
        // //==================================================//
        // // rom_file[2] = 32'b000000001010_00001_011_00011_0010011;
        // rom_file[2] = 32'h00A0B193;
        // //SLTIU x3 x1 10
        // //-5와 10을 비교해서 signed(-5)<10은 거짓이기 때문에 x3에 0저장
        // //rd: x3
        // //rs1: x1(signed(-5)=41253214...)
        // //imm: 10
        // //결과: x3에 0 저장


        // //==================================================//
        // // rom_file[3] = 32'b000000001010_00001_100_00100_0010011;
        // // rom_file[3] = 32'b0000_0000_1010_0000_1100_0010_0001_0011;
        // rom_file[3] = 32'h00A0C213;
        // //XORI x4 x1 10
        // //1111 1111 .... 0001 : 0xFFFFFFF1 : -15

        // ///==================================================//
        // //rom_file[4] = 0000 0000 1010 0000 1110 0010 1001 0011
        // rom_file[4] = 32'h00a0e293;
        // //ORI x5 x1 10
        // //1111 1111 .... 0001 : 0xFFFFFFF1 : -15
        // //rd: x5
        // //rs1: x1
        // //imm: 10
         
        rom_file[0] = 32'h0041_82b3; // add x5,x3,x4
        rom_file[1] = 32'h4074_0333; // sub x6,x8,x7
        rom_file[2] = 32'h0021_0663; // beq x2, x2, 12
        rom_file[3] = 32'h0081_2123; // sw x8, 2(x2): rs1(base)=2, imm(offset)=2
        rom_file[4] = 32'h0021_2383; // lw x7, 2(x2)

        rom_file[5] = 32'h0041_82b3; // add x5 x3 x4
        rom_file[6] = 32'h4074_0333; // sub x6 x8 x7
        rom_file[7] = 32'h1234_5537; //lui x10, 0x1234_5000
        rom_file[8] = 32'h0000_a297; //auipc x5, 10
    end

    assign instr_code = rom_file[instr_raddr[5:2]]; //pc count가 4씩 증가할 때 주소는 1씩 증가하도록

endmodule